Revit 2027 API
Room.IsPointInRoom Method
Determines if a point lies within the volume of the room.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsPointInRoom(
	XYZ point
)
Public Function IsPointInRoom (
	point As XYZ
) As Boolean
public:
bool IsPointInRoom(
	XYZ^ point
)
member IsPointInRoom :
        point : XYZ -> bool
Parameters
point XYZ
Point to be checked.
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the point is null.
ArgumentException |  The coordinates of the point is not a number.
See Also
Reference
Room Class
Autodesk.Revit.DB.Architecture Namespace